Revit 2027 API
ParameterTypeId.RevealProfileParam Property
 "Profile"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RevealProfileParam { get; }
Public Shared ReadOnly Property RevealProfileParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RevealProfileParam {
	ForgeTypeId^ get ();
}
static member RevealProfileParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace